liq = ['Какой язык программирования вы используете? (Java Script, Python, Scratch, Sh1t++)',
 'Какое занятие вы предпочитаете? (Программирование, Чтение, ИГРА В ДОТУ, Пение)', 
 'Какой ваш любимый исполнитель музыки? (Инстасамка, Майкл Джексон, БТС, Кэтти Пэрри)', 
 'Какое оружее вы предпочли бы? (Бита, Нож, Пистолет, Топор)'
 ]

ans_list = [['Java Script', 'Python', 'Scratch', 'Sh1t++'], ['Программирование', 'Чтение', 'ИГРА В ДОТУ', 'Пение'], [], []]

res_list = ['SyntaxError', 'OutofMemoryError', 'RecursionError', 'GilError', 'TypeError']